;///////////////////////////////////////////////////////////////////
;
[L8]
;
sysTitle    = 立林L8小区管理软件-C

;[message]
msgUserErr  = 请输入正确的用户名和密码!
msgNoConfig = 没有配置文件!
msgNoLang   = 没有语言文件!
msgComm	    = 通信:已连接
msgNoComm   = 通信:未连接

msgGetAdminAuthor = 请取得管理员授权！
msgUnexpectedError = 发生意外错误!请退出重新执行程序!

msgRoomDataClear = 确定要清空房屋数据吗？
msgClearFail = 清除失败!
msgClearFinish = 清除完成!
msgInitialize = 正在努力初始化...
msgInitializeFinish = 初始化完成!
msgDelHaveChild = 有子项目,确定要全部删除吗？

msgUnitON = 主机上电
msgUserON = 分机上电

msgReady = 数据整理中，请稍候...
msgStartReg = 开始注册...
msgRegOver  = 注册完毕!

msgSysPrompts = 系统提示
msgImportSuccess = 数据导入成功！
msgImportFail = 数据导入失败！
msgSelectCmd = 请选择注册或注销命令! 
msgCardHaveCmd = 该卡有未完成的操作!
msgInputUnit = 请输入正确的主机号码!
msgInputUser = 请输入正确的分机号码!
msgInputDevice = 请输入设备编号!
msgInputDevRepeat = 设备编号重复!
msgClearing = 数据清除中，请稍候...
msgClearOver = 数据清除完毕!

msgNoCmd = 没有指令需要执行!
msgCmdSending = 指令开始执行...
msgSentOK = 指令发送成功!
msgNeverSent = 指令未发送!
msgNoSent = 指令发送失败!
msgCmdSentOver = 指令执行完毕!

msgLinkTimeout = 连接超时!
msgLinkFail = 通信未连接!

msgTimes = 耗时:
msgReading = 读取中...
msgReadOver = 读取完毕

msgDo0  = 未读
msgDo1  = 已读
msgDo2  = 已处理

msgDel     = 确定要删除该记录吗？
msgDelAll  = 确定要删除全部记录吗？
msgClear   = 确定要对所选设备执行清除卡的操作吗？
msgDelConfirm = 确定要删除
msgDelEnd = 吗？

msgQueryWrong = 查询截止日期不能小于起始日期！
msgAlertRecord = 预警记录
msgData = 数据

msgConfigSuccess = 您的配置已经生效！
msgUpdatingConfig = 正在更新配置，请稍候...
msgInstallSQL = 请先安装SQL Server！
msgConfigError = 数据源配置出现意外错误，建议您手工配置！
msgConfigException = 在配置数据源的过程中出现了未知的错误，请重试！

msgSysCannotSet = 系统没有正确安装ODBC，无法进行设置！
msgDBPathError = 取数据库路径时出现错误，请与程序提供商联系！

msgCloseTables = 请关闭其它还在使用的表单！
msgNoDSN = 请先运行系统配置程序，配置系统运行参数后再运行程序！
msgSelBupDB = 请选择需要备份的数据库！
msgSelResDB = 请选择需要还原的数据库！
msgFileName = 文件名重复！
msgBackuping = 正在备份数据库，请稍候！
msgRestoring = 正在还原数据库，请稍候！
msgBackupFinish = 备份成功！
msgBackupFail = 备份失败！
msgRestoreFinish = 还原成功！
msgRestoreFail = 还原失败！
msgRestoreConfirm = 需要将文件
msgRestoreInto = 还原成数据库

msgUserNull = 用户名不能为空！
msgUserExist = 用户名已存在，请重新输入！
msgPswNull = 密码不能为空！
msgPswDismatch = 密码不一致，请重新输入！

msgEnterUser = 请输入账号名！
msgEnterPsw = 请输入登录密码！
msgChoosePermission = 请选择账号权限！
msgUserNotExist = 您输入的用户名不存在！

msgNoSenseLock = 打开加密狗设备失败，错误代码为：
msgExecuteFail = 执行模块失败，错误代码为：

msgOpenFail = 无法打开！
msgMaxScreen = 分机最多只能存储32屏信息！
msgInfoEmpty = 信息为空！
msgOpenPort = 请打开通信端口！
msgReleaseComplete = 信息发布完毕！
msgSaveChanges = 是否保存修改？

msgPortOpened = 通信端口已打开！
msgPortNotOpened = 通信端口未打开！
msgPortDisConnect = 通信端口已断开！
msgProvideCard = 请提供卡号！
msgProvideDevice = 请提供设备号！

msgDownloadOK = 下载成功！
msgReadCardOK = 卡号读取成功！
msgCommunicateFail = 通信失败！
msgNoCard = 无卡！
msgOperateOK = 操作成功！
msgOperateFail = 操作失败！
msgNoAvailable = 无扇区可用！
msgNotCorrespond = 卡号不对应！

msgAddrExist = 楼栋信息已存在，无法重复添加！
msgDevExist = 该设备已存在，无法重复添加！
msgUserMacAmount = 该分机已注册15张卡，请重新选择分机进行注册！
msgChooseWall = 请选择需要注册的围墙机！
msgNone = 无

;[note]
noteReceive = 接收:
noteError = 错误:
noteSend = 发送:

noteCall = 呼叫分机
noteTotal = 共有
noteRecords = 笔记录
noteCurrent = 当前是第
noteRecord = 笔记录

;[Caption]
menu1 = 房产管理
menu2 = 设备信息
menu3 = 门禁管理
menu31 = 下载卡
menu32 = 注销卡
menu33 = 提取卡
menu34 = 清除卡
menu35 = 卡中心
menu36 = 发卡器
menu37 = 写卡器
menu4 = 报警中心
menu5 = 刷卡记录
menu6 = 设置

pMenuAddrAdd = 增加楼栋
pMenuAddrEdit = 编辑楼栋
pMenuAddrDel = 删除楼栋
pMenuAddrRefresh = 刷新楼栋
pMenuAddrParam = 楼栋参数

pMenuDevAdd = 增加设备
pMenuDevEdit = 编辑设备
pMenuDevDel = 删除设备
pMenuRefresh = 刷新设备

pMenuUserAdd = 添加账号
pMenuUserEdit = 编辑权限
pMenuUserDel = 删除账号

gbDev = 请选择设备
gbCardType = 请选择注册卡类型
ckbBatch = 批量注册

gbCommandSending = 待发送指令：
gbCommandReceived = 已接收指令：
gbCommand = 指令：
gbCommandState = 指令状态：

gbComLink = 通信连接
gbOptions = 选项
gbCardList = 卡列表
gbDevNO = 设备号码
gbOperateCmd = 操作命令

gbUserAdmin = 用户管理
gbPersonal = 个人中心

cpCommunity = 小区

;[DBGrid]
dgAddrColum1 = 设备地址
dgAddrColum2 = 上属楼栋
dgAddrColum3 = 设备号码
dgAddrColum4 = 备注

dgDevColum1 = 设备类型
dgDevColum2 = 设备号码
dgDevColum3 = 设备地址
dgDevColum4 = 备注

dgAlarmColum1 = 报警类型
dgAlarmColum2 = 设备地址
dgAlarmColum3 = 状态
dgAlarmColum4 = 报警时间
dgAlarmColum5 = 报警内容
dgAlarmColum6 = 处理情况

dgCardRecColum1 = 卡类型
dgCardRecColum2 = 卡号
dgCardRecColum3 = 刷卡点
dgCardRecColum4 = 刷卡时间

dgUserColum1 = 账号名
dgUserColum2 = 账号权限
dgUserColum3 = 账号密码

dgCardColum1 = 卡类型
dgCardColum2 = 卡号
dgCardColum3 = 主机
dgCardColum4 = 分机
dgCardColum5 = 卡状态
dgCardColum6 = 围墙机
dgCardColum7 = 属性
dgCardColum8 = 姓名

;[Label]
labType = 类型
labAddr	= 地址
labDevNo = 设备号码
labUnitMac = 主机
labUserMac = 分机
labAmount = 数量
labCardNo = 卡号
labCOM = 通信端口
labWall = 围墙机
labDeadLine = 期限
labMemo	= 备注
labTo = 到
labName = 名称
labUserName = 用户名:
labPassword = 登录密码:
labPermission = 用户权限:

labDefaultName = 某某

labCOMProperty = 通讯属性
typeSerialPort = 采用串行口(RS-232)通讯
typeProtocol = 采用网络(TCP/IP)通讯
labCenterNumber = 管理中心号码
labReceivePort = 接收端口
labSendPort = 发送端口

labUser = 用户名:
labPsw = 用户密码:
labNewUser = 新用户名:
labNewPsw = 请输入新密码:
labNewPswConfirm = 请确认新密码:

;[UserParam]
gbUserP1 = 栋号
gbUserP2 = 单元
gbUserP3 = 层号
gbUserP4 = 房号

labNoLen = 编码位数
labFromTo = 从                       到
labDateFromTo = 日期从...到...
labNoName = 编码名称
labNoOrd  = 编码顺序

bName = 栋
uName = 单元
fName = 层
hName = 室

ckbDev = 同时初始化设备
labID = 标识
labDevNO = 设备号
labDevName = 名称

btnEG = 示例
btnUser = 初始化

;[Types]
devType0 = 管理机
devType1 = 主机
devType2 = 副主机
devType3 = 分机
devType4 = 围墙机
devTypeA = 全部设备
devTypeN = 无设备

cardType0 = 住户卡
cardType1 = 物业卡
cardType2 = 系统卡
cardType3 = 巡更卡

cardTypeX = 无效卡
cardTypeV = 有效卡
cardTypeC = 普通卡
cardTypeU = 未知
cardTypeA = 全部

alarmType0 = 求助报警
alarmType1 = 开门报警
alarmType2 = 主机上电
alarmType3 = 分机上电
alarmType4 = 防区触发报警

alarmState0 = 未读
alarmState1 = 已读
alarmState2 = 未处理
alarmState3 = 已处理
alarmState4 = 全部

userType0 = 管理员
userType1 = 访客

chosenYes = 是
chosenNo = 否

stateInvalid = 无效
stateValid = 有效
stateUnknown = 未知

;[Button]
btnQry = 查询
btnOK = 确定
btnCancel = 取消
btnSel = 选取
btnImport = 导入Excel表格数据
btnDel = 删除
btnClear = 清除
btnDownLoad = 下载卡
btnExtract = 提取
btnConnect = 连接
btnDisCon  = 断开
btnRead = 读取卡号
btnCancelCard = 注销卡
btnEditTime = 修改时间
btnCardStatus = 卡状态
btnRestoreCard = 还原卡
btnRefresh = 刷新
btnSave = 保存
btnEdit = 编辑
btnMore = 高级
btnHide = 隐藏
btnBack = 返回

btnClose = 关闭
btnDefault = 默认
btnAdd = 增加

btnOpenFiles = 打开文档
btnSinglePage = 单页传送
btnContiTransmit = 连续传送
btnSimulative = 模拟演示
btnSaveConti = 保存并继续
btnListView = 列表视图

;[sb_tips]
sb_tips0 = 通信
sb_tips1 = 未连接
sb_tips2 = 已连接
sb_tips3 = 握手
sb_tips4 = 发送
sb_tips5 = 接收
sb_tips6 = 有效
sb_tips7 = 无效
sb_tips8 = 用户:管理员
sb_tips9 = 用户:访客
sb_tipsTime = 耗时

;[Text]
strUserNo = 用户号
strCardType = 卡类型
strCardNo = 卡号
strCard6  = 属性

strNO = 编号
strName = 名称

strRegisterCard = 注册卡
strCardRecord = 刷卡记录
strRecordTime = 刷卡时间
strDeviceInfo = 设备信息

;[Hint]
hintManagement = 点击鼠标右键进行管理！
hintAddCards = 双击操作,可以添加卡！
hintChooseCards = 双击操作,可以选取卡！
hintProcessState = 双击操作,可以改变处理情况！

;[login1]
loginTitle = 请输入账号和密码
loginUser  = 账号
loginPsw   = 密码
loginVerify= 验证账号和密码...

;[connect]
labConnectPort = 通信端口
msgConnectF = 连接失败,请重新选择端口!
msgSaveParam = 参数设置成功！

;//////////////////////////////////////////////////////////////////